In [3]:
import pandas as pd

In [19]:
df = pd.read_csv(
    "train.csv",
    nrows = 15
)

df1 = df[["PassengerId", "Name", "Age"]]
df2 = df[["PassengerId", "Survived"]]

display(df1.head())
display(df2.head())

   PassengerId                                               Name   Age
0            1                            Braund, Mr. Owen Harris  22.0
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2            3                             Heikkinen, Miss. Laina  26.0
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4            5                           Allen, Mr. William Henry  35.0

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [23]:
display(pd.merge(df1,df2,on='PassengerId'))

,PassengerId,Name,Age,Survived
0,1,"Braund, Mr. Owen Harris",22.0,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1
2,3,"Heikkinen, Miss. Laina",26.0,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1
4,5,"Allen, Mr. William Henry",35.0,0
5,6,"Moran, Mr. James",NaN,0
6,7,"McCarthy, Mr. Timothy J",54.0,0
7,8,"Palsson, Master. Gosta Leonard",2.0,0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",27.0,1
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",14.0,1
10,11,"Sandstrom, Miss. Marguerite Rut",4.0,1
11,12,"Bonnell, Miss. Elizabeth",58.0,1
12,13,"Saundercock, Mr. William Henry",20.0,0
13,14,"Andersson, Mr. Anders Johan",39.0,0
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",14.0,0

In [29]:
sub1 = df.iloc[:5]
sub2 = df.iloc[5:10]

display(sub1)
display(sub2)

display(pd.concat([sub1, sub2]))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C